program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.5.2"}, {"coremlc-version", "3304.6.2"}})]
{
    func main<ios16>(tensor<fp16, [1, 128, 1, 3000]> melspectrogram_features) {
            tensor<string, []> var_116_pad_type_0 = const()[name = tensor<string, []>("op_116_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_116_pad_0 = const()[name = tensor<string, []>("op_116_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> var_116_strides_0 = const()[name = tensor<string, []>("op_116_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_116_dilations_0 = const()[name = tensor<string, []>("op_116_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_116_groups_0 = const()[name = tensor<string, []>("op_116_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 128, 1, 3]> var_85_to_fp16 = const()[name = tensor<string, []>("op_85_to_fp16"), val = tensor<fp16, [1280, 128, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1280]> var_97_to_fp16 = const()[name = tensor<string, []>("op_97_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(983168)))];
            tensor<fp16, [1, 1280, 1, 3000]> var_116_cast_fp16 = conv(bias = var_97_to_fp16, dilations = var_116_dilations_0, groups = var_116_groups_0, pad = var_116_pad_0, pad_type = var_116_pad_type_0, strides = var_116_strides_0, weight = var_85_to_fp16, x = melspectrogram_features)[name = tensor<string, []>("op_116_cast_fp16")];
            tensor<string, []> var_154_pad_type_0 = const()[name = tensor<string, []>("op_154_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_154_pad_0 = const()[name = tensor<string, []>("op_154_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> var_154_strides_0 = const()[name = tensor<string, []>("op_154_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_154_dilations_0 = const()[name = tensor<string, []>("op_154_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_154_groups_0 = const()[name = tensor<string, []>("op_154_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 128, 1, 3]> op_129_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [245760]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(985792))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1231616))), name = tensor<string, []>("op_129_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 128, 1, 3])];
            tensor<fp16, [1280]> var_135_to_fp16 = const()[name = tensor<string, []>("op_135_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1231744)))];
            tensor<fp16, [1, 1280, 1, 3000]> var_154_cast_fp16 = conv(bias = var_135_to_fp16, dilations = var_154_dilations_0, groups = var_154_groups_0, pad = var_154_pad_0, pad_type = var_154_pad_type_0, strides = var_154_strides_0, weight = op_129_to_fp16_palettized, x = melspectrogram_features)[name = tensor<string, []>("op_154_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 3000]> var_156_cast_fp16 = add(x = var_116_cast_fp16, y = var_154_cast_fp16)[name = tensor<string, []>("op_156_cast_fp16")];
            tensor<string, []> hidden_states_1_mode_0 = const()[name = tensor<string, []>("hidden_states_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1, 3000]> hidden_states_1_cast_fp16 = gelu(mode = hidden_states_1_mode_0, x = var_156_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<string, []> var_202_pad_type_0 = const()[name = tensor<string, []>("op_202_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_202_pad_0 = const()[name = tensor<string, []>("op_202_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> var_202_strides_0 = const()[name = tensor<string, []>("op_202_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_202_dilations_0 = const()[name = tensor<string, []>("op_202_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_202_groups_0 = const()[name = tensor<string, []>("op_202_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 3]> var_171_to_fp16 = const()[name = tensor<string, []>("op_171_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1234368)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_202_cast_fp16 = conv(bias = var_97_to_fp16, dilations = var_202_dilations_0, groups = var_202_groups_0, pad = var_202_pad_0, pad_type = var_202_pad_type_0, strides = var_202_strides_0, weight = var_171_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<string, []> var_240_pad_type_0 = const()[name = tensor<string, []>("op_240_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_240_pad_0 = const()[name = tensor<string, []>("op_240_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<int32, [2]> var_240_strides_0 = const()[name = tensor<string, []>("op_240_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_240_dilations_0 = const()[name = tensor<string, []>("op_240_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_240_groups_0 = const()[name = tensor<string, []>("op_240_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 3]> op_215_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [2457600]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11064832))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13522496))), name = tensor<string, []>("op_215_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 3])];
            tensor<fp16, [1280]> var_221_to_fp16 = const()[name = tensor<string, []>("op_221_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13522624)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_240_cast_fp16 = conv(bias = var_221_to_fp16, dilations = var_240_dilations_0, groups = var_240_groups_0, pad = var_240_pad_0, pad_type = var_240_pad_type_0, strides = var_240_strides_0, weight = op_215_to_fp16_palettized, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_240_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> var_242_cast_fp16 = add(x = var_202_cast_fp16, y = var_240_cast_fp16)[name = tensor<string, []>("op_242_cast_fp16")];
            tensor<string, []> hidden_states_3_mode_0 = const()[name = tensor<string, []>("hidden_states_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1280, 1, 1500]> hidden_states_3_cast_fp16 = gelu(mode = hidden_states_3_mode_0, x = var_242_cast_fp16)[name = tensor<string, []>("hidden_states_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> var_262_to_fp16 = const()[name = tensor<string, []>("op_262_to_fp16"), val = tensor<fp16, [1, 1280, 1, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13525248)))];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_1_cast_fp16 = add(x = hidden_states_3_cast_fp16, y = var_262_to_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_276 = const()[name = tensor<string, []>("op_276"), val = tensor<int32, []>(3)];
            tensor<int32, [1]> out_1_axes_0 = const()[name = tensor<string, []>("out_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, []> var_295_to_fp16 = const()[name = tensor<string, []>("op_295_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> out_1_cast_fp16 = layer_norm(axes = out_1_axes_0, epsilon = var_295_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [1280]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17365312)))];
            tensor<fp16, [1280]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17367936)))];
            tensor<fp16, [1280]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17370560)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = var_97_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<string, []> var_317_pad_type_0 = const()[name = tensor<string, []>("op_317_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_317_strides_0 = const()[name = tensor<string, []>("op_317_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_317_pad_0 = const()[name = tensor<string, []>("op_317_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_317_dilations_0 = const()[name = tensor<string, []>("op_317_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_317_groups_0 = const()[name = tensor<string, []>("op_317_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_q_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17373184))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18192448))), name = tensor<string, []>("layers_0_self_attn_q_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_q_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18192576)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_317_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_inlier_module_bias_to_fp16, dilations = var_317_dilations_0, groups = var_317_groups_0, pad = var_317_pad_0, pad_type = var_317_pad_type_0, strides = var_317_strides_0, weight = layers_0_self_attn_q_proj_inlier_module_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("op_317_cast_fp16")];
            tensor<string, []> var_323_pad_type_0 = const()[name = tensor<string, []>("op_323_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_323_strides_0 = const()[name = tensor<string, []>("op_323_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_323_pad_0 = const()[name = tensor<string, []>("op_323_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_323_dilations_0 = const()[name = tensor<string, []>("op_323_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_323_groups_0 = const()[name = tensor<string, []>("op_323_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18275392))), name = tensor<string, []>("layers_0_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [40058]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18195200))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_323_cast_fp16 = conv(dilations = var_323_dilations_0, groups = var_323_groups_0, pad = var_323_pad_0, pad_type = var_323_pad_type_0, strides = var_323_strides_0, weight = layers_0_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified, x = obj_1_cast_fp16)[name = tensor<string, []>("op_323_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> query_1_cast_fp16 = add(x = var_317_cast_fp16, y = var_323_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<string, []> var_332_pad_type_0 = const()[name = tensor<string, []>("op_332_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_332_strides_0 = const()[name = tensor<string, []>("op_332_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_332_pad_0 = const()[name = tensor<string, []>("op_332_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_332_dilations_0 = const()[name = tensor<string, []>("op_332_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_332_groups_0 = const()[name = tensor<string, []>("op_332_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_k_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18480256))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19299520))), name = tensor<string, []>("layers_0_self_attn_k_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_332_cast_fp16 = conv(dilations = var_332_dilations_0, groups = var_332_groups_0, pad = var_332_pad_0, pad_type = var_332_pad_type_0, strides = var_332_strides_0, weight = layers_0_self_attn_k_proj_inlier_module_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("op_332_cast_fp16")];
            tensor<string, []> var_338_pad_type_0 = const()[name = tensor<string, []>("op_338_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_338_strides_0 = const()[name = tensor<string, []>("op_338_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_338_pad_0 = const()[name = tensor<string, []>("op_338_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_338_dilations_0 = const()[name = tensor<string, []>("op_338_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_338_groups_0 = const()[name = tensor<string, []>("op_338_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19363520))), name = tensor<string, []>("layers_0_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [31892]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19299648))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_338_cast_fp16 = conv(dilations = var_338_dilations_0, groups = var_338_groups_0, pad = var_338_pad_0, pad_type = var_338_pad_type_0, strides = var_338_strides_0, weight = layers_0_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified, x = obj_1_cast_fp16)[name = tensor<string, []>("op_338_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> key_1_cast_fp16 = add(x = var_332_cast_fp16, y = var_338_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<string, []> var_348_pad_type_0 = const()[name = tensor<string, []>("op_348_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_348_strides_0 = const()[name = tensor<string, []>("op_348_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_348_pad_0 = const()[name = tensor<string, []>("op_348_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_348_dilations_0 = const()[name = tensor<string, []>("op_348_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_348_groups_0 = const()[name = tensor<string, []>("op_348_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_v_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19568384))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20387648))), name = tensor<string, []>("layers_0_self_attn_v_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_v_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20387776)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_348_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_inlier_module_bias_to_fp16, dilations = var_348_dilations_0, groups = var_348_groups_0, pad = var_348_pad_0, pad_type = var_348_pad_type_0, strides = var_348_strides_0, weight = layers_0_self_attn_v_proj_inlier_module_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("op_348_cast_fp16")];
            tensor<string, []> var_354_pad_type_0 = const()[name = tensor<string, []>("op_354_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_354_strides_0 = const()[name = tensor<string, []>("op_354_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_354_pad_0 = const()[name = tensor<string, []>("op_354_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_354_dilations_0 = const()[name = tensor<string, []>("op_354_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_354_groups_0 = const()[name = tensor<string, []>("op_354_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20474048))), name = tensor<string, []>("layers_0_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [41792]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20390400))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_354_cast_fp16 = conv(dilations = var_354_dilations_0, groups = var_354_groups_0, pad = var_354_pad_0, pad_type = var_354_pad_type_0, strides = var_354_strides_0, weight = layers_0_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified, x = obj_1_cast_fp16)[name = tensor<string, []>("op_354_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> value_1_cast_fp16 = add(x = var_348_cast_fp16, y = var_354_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_357 = const()[name = tensor<string, []>("op_357"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> mh_q_1_cast_fp16 = reshape(shape = var_357, x = query_1_cast_fp16)[name = tensor<string, []>("mh_q_1_cast_fp16")];
            tensor<fp16, []> var_359_to_fp16 = const()[name = tensor<string, []>("op_359_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1500]> var_360_cast_fp16 = mul(x = mh_q_1_cast_fp16, y = var_359_to_fp16)[name = tensor<string, []>("op_360_cast_fp16")];
            tensor<int32, [4]> var_361 = const()[name = tensor<string, []>("op_361"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_362_cast_fp16 = reshape(shape = var_361, x = key_1_cast_fp16)[name = tensor<string, []>("op_362_cast_fp16")];
            tensor<bool, []> mh_w_1_transpose_x_0 = const()[name = tensor<string, []>("mh_w_1_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_1_transpose_y_0 = const()[name = tensor<string, []>("mh_w_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1500, 1500]> mh_w_1_cast_fp16 = matmul(transpose_x = mh_w_1_transpose_x_0, transpose_y = mh_w_1_transpose_y_0, x = var_360_cast_fp16, y = var_362_cast_fp16)[name = tensor<string, []>("mh_w_1_cast_fp16")];
            tensor<fp16, [1, 20, 1500, 1500]> var_365_cast_fp16 = softmax(axis = var_276, x = mh_w_1_cast_fp16)[name = tensor<string, []>("op_365_cast_fp16")];
            tensor<int32, [4]> var_366 = const()[name = tensor<string, []>("op_366"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_367_cast_fp16 = reshape(shape = var_366, x = value_1_cast_fp16)[name = tensor<string, []>("op_367_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_0 = const()[name = tensor<string, []>("attn_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_0 = const()[name = tensor<string, []>("attn_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 20, 64, 1500]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_0, transpose_y = attn_1_transpose_y_0, x = var_367_cast_fp16, y = var_365_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<int32, [4]> var_370 = const()[name = tensor<string, []>("op_370"), val = tensor<int32, [4]>([1, 1280, 1, -1])];
            tensor<fp16, [1, 1280, 1, 1500]> input_1_cast_fp16 = reshape(shape = var_370, x = attn_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> var_380_pad_type_0 = const()[name = tensor<string, []>("op_380_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_380_strides_0 = const()[name = tensor<string, []>("op_380_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_380_pad_0 = const()[name = tensor<string, []>("op_380_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_380_dilations_0 = const()[name = tensor<string, []>("op_380_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_380_groups_0 = const()[name = tensor<string, []>("op_380_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_o_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20678912))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21498176))), name = tensor<string, []>("layers_0_self_attn_o_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_o_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21498304)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_380_cast_fp16 = conv(bias = layers_0_self_attn_o_proj_inlier_module_bias_to_fp16, dilations = var_380_dilations_0, groups = var_380_groups_0, pad = var_380_pad_0, pad_type = var_380_pad_type_0, strides = var_380_strides_0, weight = layers_0_self_attn_o_proj_inlier_module_weight_to_fp16_palettized, x = input_1_cast_fp16)[name = tensor<string, []>("op_380_cast_fp16")];
            tensor<string, []> var_386_pad_type_0 = const()[name = tensor<string, []>("op_386_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_386_strides_0 = const()[name = tensor<string, []>("op_386_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_386_pad_0 = const()[name = tensor<string, []>("op_386_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_386_dilations_0 = const()[name = tensor<string, []>("op_386_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_386_groups_0 = const()[name = tensor<string, []>("op_386_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_o_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21553024))), name = tensor<string, []>("layers_0_self_attn_o_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [25985]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21500928))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_386_cast_fp16 = conv(dilations = var_386_dilations_0, groups = var_386_groups_0, pad = var_386_pad_0, pad_type = var_386_pad_type_0, strides = var_386_strides_0, weight = layers_0_self_attn_o_proj_outlier_module_weight_to_fp16_sparsified, x = input_1_cast_fp16)[name = tensor<string, []>("op_386_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> obj_3_cast_fp16 = add(x = var_380_cast_fp16, y = var_386_cast_fp16)[name = tensor<string, []>("obj_3_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = obj_3_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> out_3_axes_0 = const()[name = tensor<string, []>("out_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, []> var_397_to_fp16 = const()[name = tensor<string, []>("op_397_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> out_3_cast_fp16 = layer_norm(axes = out_3_axes_0, epsilon = var_397_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [1280]> input_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_3_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21757888)))];
            tensor<fp16, [1280]> input_3_beta_0_to_fp16 = const()[name = tensor<string, []>("input_3_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21760512)))];
            tensor<fp16, []> input_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> input_3_cast_fp16 = batch_norm(beta = input_3_beta_0_to_fp16, epsilon = input_3_epsilon_0_to_fp16, gamma = input_3_gamma_0_to_fp16, mean = var_97_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_3_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> var_415_pad_type_0 = const()[name = tensor<string, []>("op_415_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_415_strides_0 = const()[name = tensor<string, []>("op_415_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_415_pad_0 = const()[name = tensor<string, []>("op_415_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_415_dilations_0 = const()[name = tensor<string, []>("op_415_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_415_groups_0 = const()[name = tensor<string, []>("op_415_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [5120, 1280, 1, 1]> layers_0_fc1_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3276800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21763136))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25040000))), name = tensor<string, []>("layers_0_fc1_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([5120, 1280, 1, 1])];
            tensor<fp16, [5120]> layers_0_fc1_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_inlier_module_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25040128)))];
            tensor<fp16, [1, 5120, 1, 1500]> var_415_cast_fp16 = conv(bias = layers_0_fc1_inlier_module_bias_to_fp16, dilations = var_415_dilations_0, groups = var_415_groups_0, pad = var_415_pad_0, pad_type = var_415_pad_type_0, strides = var_415_strides_0, weight = layers_0_fc1_inlier_module_weight_to_fp16_palettized, x = input_3_cast_fp16)[name = tensor<string, []>("op_415_cast_fp16")];
            tensor<string, []> var_421_pad_type_0 = const()[name = tensor<string, []>("op_421_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_421_strides_0 = const()[name = tensor<string, []>("op_421_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_421_pad_0 = const()[name = tensor<string, []>("op_421_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_421_dilations_0 = const()[name = tensor<string, []>("op_421_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_421_groups_0 = const()[name = tensor<string, []>("op_421_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [5120, 1280, 1, 1]> layers_0_fc1_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25353152))), name = tensor<string, []>("layers_0_fc1_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [151326]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25050432))), shape = tensor<uint32, [4]>([5120, 1280, 1, 1])];
            tensor<fp16, [1, 5120, 1, 1500]> var_421_cast_fp16 = conv(dilations = var_421_dilations_0, groups = var_421_groups_0, pad = var_421_pad_0, pad_type = var_421_pad_type_0, strides = var_421_strides_0, weight = layers_0_fc1_outlier_module_weight_to_fp16_sparsified, x = input_3_cast_fp16)[name = tensor<string, []>("op_421_cast_fp16")];
            tensor<fp16, [1, 5120, 1, 1500]> input_5_cast_fp16 = add(x = var_415_cast_fp16, y = var_421_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_7_mode_0 = const()[name = tensor<string, []>("input_7_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 5120, 1, 1500]> input_7_cast_fp16 = gelu(mode = input_7_mode_0, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> var_432_pad_type_0 = const()[name = tensor<string, []>("op_432_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_432_strides_0 = const()[name = tensor<string, []>("op_432_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_432_pad_0 = const()[name = tensor<string, []>("op_432_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_432_dilations_0 = const()[name = tensor<string, []>("op_432_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_432_groups_0 = const()[name = tensor<string, []>("op_432_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 5120, 1, 1]> layers_0_fc2_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3276800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26172416))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29449280))), name = tensor<string, []>("layers_0_fc2_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 5120, 1, 1])];
            tensor<fp16, [1280]> layers_0_fc2_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc2_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29449408)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_432_cast_fp16 = conv(bias = layers_0_fc2_inlier_module_bias_to_fp16, dilations = var_432_dilations_0, groups = var_432_groups_0, pad = var_432_pad_0, pad_type = var_432_pad_type_0, strides = var_432_strides_0, weight = layers_0_fc2_inlier_module_weight_to_fp16_palettized, x = input_7_cast_fp16)[name = tensor<string, []>("op_432_cast_fp16")];
            tensor<string, []> var_438_pad_type_0 = const()[name = tensor<string, []>("op_438_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_438_strides_0 = const()[name = tensor<string, []>("op_438_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_438_pad_0 = const()[name = tensor<string, []>("op_438_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_438_dilations_0 = const()[name = tensor<string, []>("op_438_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_438_groups_0 = const()[name = tensor<string, []>("op_438_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 5120, 1, 1]> layers_0_fc2_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29689088))), name = tensor<string, []>("layers_0_fc2_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [118467]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29452032))), shape = tensor<uint32, [4]>([1280, 5120, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_438_cast_fp16 = conv(dilations = var_438_dilations_0, groups = var_438_groups_0, pad = var_438_pad_0, pad_type = var_438_pad_type_0, strides = var_438_strides_0, weight = layers_0_fc2_outlier_module_weight_to_fp16_sparsified, x = input_7_cast_fp16)[name = tensor<string, []>("op_438_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> hidden_states_5_cast_fp16 = add(x = var_432_cast_fp16, y = var_438_cast_fp16)[name = tensor<string, []>("hidden_states_5_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = hidden_states_5_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_448 = const()[name = tensor<string, []>("op_448"), val = tensor<int32, []>(3)];
            tensor<int32, [1]> out_5_axes_0 = const()[name = tensor<string, []>("out_5_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, []> var_467_to_fp16 = const()[name = tensor<string, []>("op_467_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> out_5_cast_fp16 = layer_norm(axes = out_5_axes_0, epsilon = var_467_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [1280]> obj_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_5_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30508352)))];
            tensor<fp16, [1280]> obj_5_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_5_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30510976)))];
            tensor<fp16, []> obj_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1500]> obj_5_cast_fp16 = batch_norm(beta = obj_5_beta_0_to_fp16, epsilon = obj_5_epsilon_0_to_fp16, gamma = obj_5_gamma_0_to_fp16, mean = var_97_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_5_cast_fp16)[name = tensor<string, []>("obj_5_cast_fp16")];
            tensor<string, []> var_489_pad_type_0 = const()[name = tensor<string, []>("op_489_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_489_strides_0 = const()[name = tensor<string, []>("op_489_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_489_pad_0 = const()[name = tensor<string, []>("op_489_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_489_dilations_0 = const()[name = tensor<string, []>("op_489_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_489_groups_0 = const()[name = tensor<string, []>("op_489_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_q_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30513600))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31332864))), name = tensor<string, []>("layers_1_self_attn_q_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_1_self_attn_q_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_q_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31332992)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_489_cast_fp16 = conv(bias = layers_1_self_attn_q_proj_inlier_module_bias_to_fp16, dilations = var_489_dilations_0, groups = var_489_groups_0, pad = var_489_pad_0, pad_type = var_489_pad_type_0, strides = var_489_strides_0, weight = layers_1_self_attn_q_proj_inlier_module_weight_to_fp16_palettized, x = obj_5_cast_fp16)[name = tensor<string, []>("op_489_cast_fp16")];
            tensor<string, []> var_495_pad_type_0 = const()[name = tensor<string, []>("op_495_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_495_strides_0 = const()[name = tensor<string, []>("op_495_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_495_pad_0 = const()[name = tensor<string, []>("op_495_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_495_dilations_0 = const()[name = tensor<string, []>("op_495_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_495_groups_0 = const()[name = tensor<string, []>("op_495_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31399552))), name = tensor<string, []>("layers_1_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [31911]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31335616))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_495_cast_fp16 = conv(dilations = var_495_dilations_0, groups = var_495_groups_0, pad = var_495_pad_0, pad_type = var_495_pad_type_0, strides = var_495_strides_0, weight = layers_1_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified, x = obj_5_cast_fp16)[name = tensor<string, []>("op_495_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> query_3_cast_fp16 = add(x = var_489_cast_fp16, y = var_495_cast_fp16)[name = tensor<string, []>("query_3_cast_fp16")];
            tensor<string, []> var_504_pad_type_0 = const()[name = tensor<string, []>("op_504_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_504_strides_0 = const()[name = tensor<string, []>("op_504_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_504_pad_0 = const()[name = tensor<string, []>("op_504_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_504_dilations_0 = const()[name = tensor<string, []>("op_504_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_504_groups_0 = const()[name = tensor<string, []>("op_504_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_k_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31604416))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32423680))), name = tensor<string, []>("layers_1_self_attn_k_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_504_cast_fp16 = conv(dilations = var_504_dilations_0, groups = var_504_groups_0, pad = var_504_pad_0, pad_type = var_504_pad_type_0, strides = var_504_strides_0, weight = layers_1_self_attn_k_proj_inlier_module_weight_to_fp16_palettized, x = obj_5_cast_fp16)[name = tensor<string, []>("op_504_cast_fp16")];
            tensor<string, []> var_510_pad_type_0 = const()[name = tensor<string, []>("op_510_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_510_strides_0 = const()[name = tensor<string, []>("op_510_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_510_pad_0 = const()[name = tensor<string, []>("op_510_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_510_dilations_0 = const()[name = tensor<string, []>("op_510_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_510_groups_0 = const()[name = tensor<string, []>("op_510_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32475264))), name = tensor<string, []>("layers_1_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [25674]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32423808))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_510_cast_fp16 = conv(dilations = var_510_dilations_0, groups = var_510_groups_0, pad = var_510_pad_0, pad_type = var_510_pad_type_0, strides = var_510_strides_0, weight = layers_1_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified, x = obj_5_cast_fp16)[name = tensor<string, []>("op_510_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> key_3_cast_fp16 = add(x = var_504_cast_fp16, y = var_510_cast_fp16)[name = tensor<string, []>("key_3_cast_fp16")];
            tensor<string, []> var_520_pad_type_0 = const()[name = tensor<string, []>("op_520_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_520_strides_0 = const()[name = tensor<string, []>("op_520_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_520_pad_0 = const()[name = tensor<string, []>("op_520_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_520_dilations_0 = const()[name = tensor<string, []>("op_520_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_520_groups_0 = const()[name = tensor<string, []>("op_520_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_v_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32680128))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33499392))), name = tensor<string, []>("layers_1_self_attn_v_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_1_self_attn_v_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_1_self_attn_v_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33499520)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_520_cast_fp16 = conv(bias = layers_1_self_attn_v_proj_inlier_module_bias_to_fp16, dilations = var_520_dilations_0, groups = var_520_groups_0, pad = var_520_pad_0, pad_type = var_520_pad_type_0, strides = var_520_strides_0, weight = layers_1_self_attn_v_proj_inlier_module_weight_to_fp16_palettized, x = obj_5_cast_fp16)[name = tensor<string, []>("op_520_cast_fp16")];
            tensor<string, []> var_526_pad_type_0 = const()[name = tensor<string, []>("op_526_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_526_strides_0 = const()[name = tensor<string, []>("op_526_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_526_pad_0 = const()[name = tensor<string, []>("op_526_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_526_dilations_0 = const()[name = tensor<string, []>("op_526_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_526_groups_0 = const()[name = tensor<string, []>("op_526_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_1_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33549632))), name = tensor<string, []>("layers_1_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [23687]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33502144))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_526_cast_fp16 = conv(dilations = var_526_dilations_0, groups = var_526_groups_0, pad = var_526_pad_0, pad_type = var_526_pad_type_0, strides = var_526_strides_0, weight = layers_1_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified, x = obj_5_cast_fp16)[name = tensor<string, []>("op_526_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> value_3_cast_fp16 = add(x = var_520_cast_fp16, y = var_526_cast_fp16)[name = tensor<string, []>("value_3_cast_fp16")];
            tensor<int32, [4]> var_529 = const()[name = tensor<string, []>("op_529"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> mh_q_3_cast_fp16 = reshape(shape = var_529, x = query_3_cast_fp16)[name = tensor<string, []>("mh_q_3_cast_fp16")];
            tensor<fp16, []> var_531_to_fp16 = const()[name = tensor<string, []>("op_531_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1500]> var_532_cast_fp16 = mul(x = mh_q_3_cast_fp16, y = var_531_to_fp16)[name = tensor<string, []>("op_532_cast_fp16")];
