program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.5.2"}, {"coremlc-version", "3304.6.2"}})]
{
    func main<ios16>(tensor<int32, [1]> cache_length, tensor<fp16, [1, 448]> decoder_key_padding_mask, tensor<fp16, [1, 1280, 1, 1500]> encoder_output_embeds, tensor<int32, [1]> input_ids, tensor<fp16, [1, 5120, 1, 448]> key_cache, tensor<fp16, [1, 448]> kv_cache_update_mask, tensor<fp16, [1, 5120, 1, 448]> value_cache) {
            tensor<int32, []> var_24_axis_0 = const()[name = tensor<string, []>("op_24_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> var_24_batch_dims_0 = const()[name = tensor<string, []>("op_24_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [51866, 1280]> embed_tokens_weight_to_fp16 = const()[name = tensor<string, []>("embed_tokens_weight_to_fp16"), val = tensor<fp16, [51866, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 1280]> var_24_cast_fp16 = gather(axis = var_24_axis_0, batch_dims = var_24_batch_dims_0, indices = input_ids, x = embed_tokens_weight_to_fp16)[name = tensor<string, []>("op_24_cast_fp16")];
            tensor<int32, []> var_31_axis_0 = const()[name = tensor<string, []>("op_31_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> var_31_batch_dims_0 = const()[name = tensor<string, []>("op_31_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [448, 1280]> embed_positions_inlier_module_weight_to_fp16 = const()[name = tensor<string, []>("embed_positions_inlier_module_weight_to_fp16"), val = tensor<fp16, [448, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132777088)))];
            tensor<fp16, [1, 1280]> var_31_cast_fp16 = gather(axis = var_31_axis_0, batch_dims = var_31_batch_dims_0, indices = cache_length, x = embed_positions_inlier_module_weight_to_fp16)[name = tensor<string, []>("op_31_cast_fp16")];
            tensor<int32, []> var_33_axis_0 = const()[name = tensor<string, []>("op_33_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> var_33_batch_dims_0 = const()[name = tensor<string, []>("op_33_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [448, 1280]> embed_positions_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [71680]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133941312))), name = tensor<string, []>("embed_positions_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [8582]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133924032))), shape = tensor<uint32, [2]>([448, 1280])];
            tensor<fp16, [1, 1280]> var_33_cast_fp16 = gather(axis = var_33_axis_0, batch_dims = var_33_batch_dims_0, indices = cache_length, x = embed_positions_outlier_module_weight_to_fp16_sparsified)[name = tensor<string, []>("op_33_cast_fp16")];
            tensor<fp16, [1, 1280]> var_34_cast_fp16 = add(x = var_31_cast_fp16, y = var_33_cast_fp16)[name = tensor<string, []>("op_34_cast_fp16")];
            tensor<fp16, [1, 1280]> hidden_states_1_cast_fp16 = add(x = var_24_cast_fp16, y = var_34_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [1]> var_48_axes_0 = const()[name = tensor<string, []>("op_48_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1280, 1]> var_48_cast_fp16 = expand_dims(axes = var_48_axes_0, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_48_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([3])];
            tensor<fp16, [1, 1280, 1, 1]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_48_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, [4]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [4]>([1280, 1280, 1280, 1280])];
            tensor<int32, []> var_53_axis_0 = const()[name = tensor<string, []>("op_53_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 1280, 1, 448]> var_53_cast_fp16_0, tensor<fp16, [1, 1280, 1, 448]> var_53_cast_fp16_1, tensor<fp16, [1, 1280, 1, 448]> var_53_cast_fp16_2, tensor<fp16, [1, 1280, 1, 448]> var_53_cast_fp16_3 = split(axis = var_53_axis_0, split_sizes = tile_0, x = key_cache)[name = tensor<string, []>("op_53_cast_fp16")];
            tensor<int32, [4]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [4]>([1280, 1280, 1280, 1280])];
            tensor<int32, []> var_60_axis_0 = const()[name = tensor<string, []>("op_60_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 1280, 1, 448]> var_60_cast_fp16_0, tensor<fp16, [1, 1280, 1, 448]> var_60_cast_fp16_1, tensor<fp16, [1, 1280, 1, 448]> var_60_cast_fp16_2, tensor<fp16, [1, 1280, 1, 448]> var_60_cast_fp16_3 = split(axis = var_60_axis_0, split_sizes = tile_1, x = value_cache)[name = tensor<string, []>("op_60_cast_fp16")];
            tensor<int32, []> var_70 = const()[name = tensor<string, []>("op_70"), val = tensor<int32, []>(3)];
            tensor<int32, [1]> out_1_axes_0 = const()[name = tensor<string, []>("out_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, []> var_96_to_fp16 = const()[name = tensor<string, []>("op_96_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> out_1_cast_fp16 = layer_norm(axes = out_1_axes_0, epsilon = var_96_to_fp16, x = inputs_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [1280]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134013056)))];
            tensor<fp16, [1280]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134015680)))];
            tensor<fp16, [1280]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134018304)))];
            tensor<fp16, [1280]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134020928)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<string, []> var_118_pad_type_0 = const()[name = tensor<string, []>("op_118_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_118_strides_0 = const()[name = tensor<string, []>("op_118_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_118_pad_0 = const()[name = tensor<string, []>("op_118_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_118_dilations_0 = const()[name = tensor<string, []>("op_118_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_118_groups_0 = const()[name = tensor<string, []>("op_118_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_q_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134023552))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134842816))), name = tensor<string, []>("layers_0_self_attn_q_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_q_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134842944)))];
            tensor<fp16, [1, 1280, 1, 1]> var_118_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_inlier_module_bias_to_fp16, dilations = var_118_dilations_0, groups = var_118_groups_0, pad = var_118_pad_0, pad_type = var_118_pad_type_0, strides = var_118_strides_0, weight = layers_0_self_attn_q_proj_inlier_module_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("op_118_cast_fp16")];
            tensor<string, []> var_124_pad_type_0 = const()[name = tensor<string, []>("op_124_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_124_strides_0 = const()[name = tensor<string, []>("op_124_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_124_pad_0 = const()[name = tensor<string, []>("op_124_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_124_dilations_0 = const()[name = tensor<string, []>("op_124_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_124_groups_0 = const()[name = tensor<string, []>("op_124_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134918592))), name = tensor<string, []>("layers_0_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [36461]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134845568))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> var_124_cast_fp16 = conv(dilations = var_124_dilations_0, groups = var_124_groups_0, pad = var_124_pad_0, pad_type = var_124_pad_type_0, strides = var_124_strides_0, weight = layers_0_self_attn_q_proj_outlier_module_weight_to_fp16_sparsified, x = obj_1_cast_fp16)[name = tensor<string, []>("op_124_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> query_1_cast_fp16 = add(x = var_118_cast_fp16, y = var_124_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<string, []> var_133_pad_type_0 = const()[name = tensor<string, []>("op_133_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_133_strides_0 = const()[name = tensor<string, []>("op_133_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_133_pad_0 = const()[name = tensor<string, []>("op_133_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_133_dilations_0 = const()[name = tensor<string, []>("op_133_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_133_groups_0 = const()[name = tensor<string, []>("op_133_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_k_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135123456))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135942720))), name = tensor<string, []>("layers_0_self_attn_k_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> var_133_cast_fp16 = conv(dilations = var_133_dilations_0, groups = var_133_groups_0, pad = var_133_pad_0, pad_type = var_133_pad_type_0, strides = var_133_strides_0, weight = layers_0_self_attn_k_proj_inlier_module_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("op_133_cast_fp16")];
            tensor<string, []> var_139_pad_type_0 = const()[name = tensor<string, []>("op_139_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_139_strides_0 = const()[name = tensor<string, []>("op_139_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_139_pad_0 = const()[name = tensor<string, []>("op_139_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_139_dilations_0 = const()[name = tensor<string, []>("op_139_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_139_groups_0 = const()[name = tensor<string, []>("op_139_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135976320))), name = tensor<string, []>("layers_0_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [16673]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135942848))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> var_139_cast_fp16 = conv(dilations = var_139_dilations_0, groups = var_139_groups_0, pad = var_139_pad_0, pad_type = var_139_pad_type_0, strides = var_139_strides_0, weight = layers_0_self_attn_k_proj_outlier_module_weight_to_fp16_sparsified, x = obj_1_cast_fp16)[name = tensor<string, []>("op_139_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> current_key_1_cast_fp16 = add(x = var_133_cast_fp16, y = var_139_cast_fp16)[name = tensor<string, []>("current_key_1_cast_fp16")];
            tensor<string, []> var_149_pad_type_0 = const()[name = tensor<string, []>("op_149_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_149_strides_0 = const()[name = tensor<string, []>("op_149_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_149_pad_0 = const()[name = tensor<string, []>("op_149_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_149_dilations_0 = const()[name = tensor<string, []>("op_149_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_149_groups_0 = const()[name = tensor<string, []>("op_149_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_v_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136181184))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137000448))), name = tensor<string, []>("layers_0_self_attn_v_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_v_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137000576)))];
            tensor<fp16, [1, 1280, 1, 1]> var_149_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_inlier_module_bias_to_fp16, dilations = var_149_dilations_0, groups = var_149_groups_0, pad = var_149_pad_0, pad_type = var_149_pad_type_0, strides = var_149_strides_0, weight = layers_0_self_attn_v_proj_inlier_module_weight_to_fp16_palettized, x = obj_1_cast_fp16)[name = tensor<string, []>("op_149_cast_fp16")];
            tensor<string, []> var_155_pad_type_0 = const()[name = tensor<string, []>("op_155_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_155_strides_0 = const()[name = tensor<string, []>("op_155_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_155_pad_0 = const()[name = tensor<string, []>("op_155_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_155_dilations_0 = const()[name = tensor<string, []>("op_155_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_155_groups_0 = const()[name = tensor<string, []>("op_155_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137046720))), name = tensor<string, []>("layers_0_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [21721]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137003200))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> var_155_cast_fp16 = conv(dilations = var_155_dilations_0, groups = var_155_groups_0, pad = var_155_pad_0, pad_type = var_155_pad_type_0, strides = var_155_strides_0, weight = layers_0_self_attn_v_proj_outlier_module_weight_to_fp16_sparsified, x = obj_1_cast_fp16)[name = tensor<string, []>("op_155_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> current_value_1_cast_fp16 = add(x = var_149_cast_fp16, y = var_155_cast_fp16)[name = tensor<string, []>("current_value_1_cast_fp16")];
            tensor<int32, [1]> var_158_axes_0 = const()[name = tensor<string, []>("op_158_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 448]> var_158_cast_fp16 = expand_dims(axes = var_158_axes_0, x = kv_cache_update_mask)[name = tensor<string, []>("op_158_cast_fp16")];
            tensor<int32, [1]> var_159_axes_0 = const()[name = tensor<string, []>("op_159_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 1, 448]> var_159_cast_fp16 = expand_dims(axes = var_159_axes_0, x = var_158_cast_fp16)[name = tensor<string, []>("op_159_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_161_cast_fp16 = mul(x = current_key_1_cast_fp16, y = var_159_cast_fp16)[name = tensor<string, []>("op_161_cast_fp16")];
            tensor<fp16, []> var_71_to_fp16 = const()[name = tensor<string, []>("op_71_to_fp16"), val = tensor<fp16, []>(0x1p+0)];
            tensor<fp16, [1, 1, 1, 448]> var_162_cast_fp16 = sub(x = var_71_to_fp16, y = var_159_cast_fp16)[name = tensor<string, []>("op_162_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_163_cast_fp16 = mul(x = var_53_cast_fp16_0, y = var_162_cast_fp16)[name = tensor<string, []>("op_163_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> key_1_cast_fp16 = add(x = var_161_cast_fp16, y = var_163_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_165_cast_fp16 = mul(x = current_value_1_cast_fp16, y = var_159_cast_fp16)[name = tensor<string, []>("op_165_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> var_167_cast_fp16 = mul(x = var_60_cast_fp16_0, y = var_162_cast_fp16)[name = tensor<string, []>("op_167_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 448]> value_1_cast_fp16 = add(x = var_165_cast_fp16, y = var_167_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_170 = const()[name = tensor<string, []>("op_170"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1]> mh_q_1_cast_fp16 = reshape(shape = var_170, x = query_1_cast_fp16)[name = tensor<string, []>("mh_q_1_cast_fp16")];
            tensor<fp16, []> var_172_to_fp16 = const()[name = tensor<string, []>("op_172_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1]> var_173_cast_fp16 = mul(x = mh_q_1_cast_fp16, y = var_172_to_fp16)[name = tensor<string, []>("op_173_cast_fp16")];
            tensor<int32, [4]> var_174 = const()[name = tensor<string, []>("op_174"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 448]> var_175_cast_fp16 = reshape(shape = var_174, x = key_1_cast_fp16)[name = tensor<string, []>("op_175_cast_fp16")];
            tensor<bool, []> mh_w_1_transpose_x_0 = const()[name = tensor<string, []>("mh_w_1_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_1_transpose_y_0 = const()[name = tensor<string, []>("mh_w_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1, 448]> mh_w_1_cast_fp16 = matmul(transpose_x = mh_w_1_transpose_x_0, transpose_y = mh_w_1_transpose_y_0, x = var_173_cast_fp16, y = var_175_cast_fp16)[name = tensor<string, []>("mh_w_1_cast_fp16")];
            tensor<int32, [1]> var_179_axes_0 = const()[name = tensor<string, []>("op_179_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 448]> var_179_cast_fp16 = expand_dims(axes = var_179_axes_0, x = decoder_key_padding_mask)[name = tensor<string, []>("op_179_cast_fp16")];
            tensor<int32, [1]> var_180_axes_0 = const()[name = tensor<string, []>("op_180_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 1, 1, 448]> var_180_cast_fp16 = expand_dims(axes = var_180_axes_0, x = var_179_cast_fp16)[name = tensor<string, []>("op_180_cast_fp16")];
            tensor<fp16, [1, 20, 1, 448]> mh_w_3_cast_fp16 = add(x = mh_w_1_cast_fp16, y = var_180_cast_fp16)[name = tensor<string, []>("mh_w_3_cast_fp16")];
            tensor<fp16, [1, 20, 1, 448]> var_183_cast_fp16 = softmax(axis = var_70, x = mh_w_3_cast_fp16)[name = tensor<string, []>("op_183_cast_fp16")];
            tensor<int32, [4]> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 448]> var_185_cast_fp16 = reshape(shape = var_184, x = value_1_cast_fp16)[name = tensor<string, []>("op_185_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_0 = const()[name = tensor<string, []>("attn_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_0 = const()[name = tensor<string, []>("attn_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 20, 64, 1]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_0, transpose_y = attn_1_transpose_y_0, x = var_185_cast_fp16, y = var_183_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<int32, [4]> var_188 = const()[name = tensor<string, []>("op_188"), val = tensor<int32, [4]>([1, 1280, 1, -1])];
            tensor<fp16, [1, 1280, 1, 1]> input_1_cast_fp16 = reshape(shape = var_188, x = attn_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> var_198_pad_type_0 = const()[name = tensor<string, []>("op_198_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_198_strides_0 = const()[name = tensor<string, []>("op_198_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_198_pad_0 = const()[name = tensor<string, []>("op_198_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_198_dilations_0 = const()[name = tensor<string, []>("op_198_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_198_groups_0 = const()[name = tensor<string, []>("op_198_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_o_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(137251584))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138070848))), name = tensor<string, []>("layers_0_self_attn_o_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_self_attn_o_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_o_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138070976)))];
            tensor<fp16, [1, 1280, 1, 1]> var_198_cast_fp16 = conv(bias = layers_0_self_attn_o_proj_inlier_module_bias_to_fp16, dilations = var_198_dilations_0, groups = var_198_groups_0, pad = var_198_pad_0, pad_type = var_198_pad_type_0, strides = var_198_strides_0, weight = layers_0_self_attn_o_proj_inlier_module_weight_to_fp16_palettized, x = input_1_cast_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<string, []> var_204_pad_type_0 = const()[name = tensor<string, []>("op_204_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_204_strides_0 = const()[name = tensor<string, []>("op_204_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_204_pad_0 = const()[name = tensor<string, []>("op_204_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_204_dilations_0 = const()[name = tensor<string, []>("op_204_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_204_groups_0 = const()[name = tensor<string, []>("op_204_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_self_attn_o_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138130624))), name = tensor<string, []>("layers_0_self_attn_o_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [28455]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138073600))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> var_204_cast_fp16 = conv(dilations = var_204_dilations_0, groups = var_204_groups_0, pad = var_204_pad_0, pad_type = var_204_pad_type_0, strides = var_204_strides_0, weight = layers_0_self_attn_o_proj_outlier_module_weight_to_fp16_sparsified, x = input_1_cast_fp16)[name = tensor<string, []>("op_204_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> obj_7_cast_fp16 = add(x = var_198_cast_fp16, y = var_204_cast_fp16)[name = tensor<string, []>("obj_7_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = obj_7_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> out_3_axes_0 = const()[name = tensor<string, []>("out_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, []> var_219_to_fp16 = const()[name = tensor<string, []>("op_219_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> out_3_cast_fp16 = layer_norm(axes = out_3_axes_0, epsilon = var_219_to_fp16, x = inputs_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [1280]> obj_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_9_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138335488)))];
            tensor<fp16, [1280]> obj_9_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_9_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138338112)))];
            tensor<fp16, []> obj_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> obj_9_cast_fp16 = batch_norm(beta = obj_9_beta_0_to_fp16, epsilon = obj_9_epsilon_0_to_fp16, gamma = obj_9_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_3_cast_fp16)[name = tensor<string, []>("obj_9_cast_fp16")];
            tensor<string, []> var_241_pad_type_0 = const()[name = tensor<string, []>("op_241_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_241_strides_0 = const()[name = tensor<string, []>("op_241_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_241_pad_0 = const()[name = tensor<string, []>("op_241_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_241_dilations_0 = const()[name = tensor<string, []>("op_241_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_241_groups_0 = const()[name = tensor<string, []>("op_241_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_q_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(138340736))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139160000))), name = tensor<string, []>("layers_0_encoder_attn_q_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_encoder_attn_q_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_q_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139160128)))];
            tensor<fp16, [1, 1280, 1, 1]> var_241_cast_fp16 = conv(bias = layers_0_encoder_attn_q_proj_inlier_module_bias_to_fp16, dilations = var_241_dilations_0, groups = var_241_groups_0, pad = var_241_pad_0, pad_type = var_241_pad_type_0, strides = var_241_strides_0, weight = layers_0_encoder_attn_q_proj_inlier_module_weight_to_fp16_palettized, x = obj_9_cast_fp16)[name = tensor<string, []>("op_241_cast_fp16")];
            tensor<string, []> var_247_pad_type_0 = const()[name = tensor<string, []>("op_247_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_247_strides_0 = const()[name = tensor<string, []>("op_247_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_247_pad_0 = const()[name = tensor<string, []>("op_247_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_247_dilations_0 = const()[name = tensor<string, []>("op_247_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_247_groups_0 = const()[name = tensor<string, []>("op_247_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_q_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139188224))), name = tensor<string, []>("layers_0_encoder_attn_q_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [12701]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139162752))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> var_247_cast_fp16 = conv(dilations = var_247_dilations_0, groups = var_247_groups_0, pad = var_247_pad_0, pad_type = var_247_pad_type_0, strides = var_247_strides_0, weight = layers_0_encoder_attn_q_proj_outlier_module_weight_to_fp16_sparsified, x = obj_9_cast_fp16)[name = tensor<string, []>("op_247_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> query_3_cast_fp16 = add(x = var_241_cast_fp16, y = var_247_cast_fp16)[name = tensor<string, []>("query_3_cast_fp16")];
            tensor<string, []> var_256_pad_type_0 = const()[name = tensor<string, []>("op_256_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_256_strides_0 = const()[name = tensor<string, []>("op_256_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_256_pad_0 = const()[name = tensor<string, []>("op_256_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_256_dilations_0 = const()[name = tensor<string, []>("op_256_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_256_groups_0 = const()[name = tensor<string, []>("op_256_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_k_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139393088))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140212352))), name = tensor<string, []>("layers_0_encoder_attn_k_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_256_cast_fp16 = conv(dilations = var_256_dilations_0, groups = var_256_groups_0, pad = var_256_pad_0, pad_type = var_256_pad_type_0, strides = var_256_strides_0, weight = layers_0_encoder_attn_k_proj_inlier_module_weight_to_fp16_palettized, x = encoder_output_embeds)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<string, []> var_262_pad_type_0 = const()[name = tensor<string, []>("op_262_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_262_strides_0 = const()[name = tensor<string, []>("op_262_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_262_pad_0 = const()[name = tensor<string, []>("op_262_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_262_dilations_0 = const()[name = tensor<string, []>("op_262_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_262_groups_0 = const()[name = tensor<string, []>("op_262_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_k_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140272448))), name = tensor<string, []>("layers_0_encoder_attn_k_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [29949]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140212480))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_262_cast_fp16 = conv(dilations = var_262_dilations_0, groups = var_262_groups_0, pad = var_262_pad_0, pad_type = var_262_pad_type_0, strides = var_262_strides_0, weight = layers_0_encoder_attn_k_proj_outlier_module_weight_to_fp16_sparsified, x = encoder_output_embeds)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> key_3_cast_fp16 = add(x = var_256_cast_fp16, y = var_262_cast_fp16)[name = tensor<string, []>("key_3_cast_fp16")];
            tensor<string, []> var_272_pad_type_0 = const()[name = tensor<string, []>("op_272_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_272_strides_0 = const()[name = tensor<string, []>("op_272_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_272_pad_0 = const()[name = tensor<string, []>("op_272_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_272_dilations_0 = const()[name = tensor<string, []>("op_272_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_272_groups_0 = const()[name = tensor<string, []>("op_272_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_v_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(140477312))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141296576))), name = tensor<string, []>("layers_0_encoder_attn_v_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_encoder_attn_v_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_v_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141296704)))];
            tensor<fp16, [1, 1280, 1, 1500]> var_272_cast_fp16 = conv(bias = layers_0_encoder_attn_v_proj_inlier_module_bias_to_fp16, dilations = var_272_dilations_0, groups = var_272_groups_0, pad = var_272_pad_0, pad_type = var_272_pad_type_0, strides = var_272_strides_0, weight = layers_0_encoder_attn_v_proj_inlier_module_weight_to_fp16_palettized, x = encoder_output_embeds)[name = tensor<string, []>("op_272_cast_fp16")];
            tensor<string, []> var_278_pad_type_0 = const()[name = tensor<string, []>("op_278_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_278_strides_0 = const()[name = tensor<string, []>("op_278_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_278_pad_0 = const()[name = tensor<string, []>("op_278_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_278_dilations_0 = const()[name = tensor<string, []>("op_278_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_278_groups_0 = const()[name = tensor<string, []>("op_278_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_v_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141310592))), name = tensor<string, []>("layers_0_encoder_attn_v_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [5596]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141299328))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1500]> var_278_cast_fp16 = conv(dilations = var_278_dilations_0, groups = var_278_groups_0, pad = var_278_pad_0, pad_type = var_278_pad_type_0, strides = var_278_strides_0, weight = layers_0_encoder_attn_v_proj_outlier_module_weight_to_fp16_sparsified, x = encoder_output_embeds)[name = tensor<string, []>("op_278_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1500]> value_3_cast_fp16 = add(x = var_272_cast_fp16, y = var_278_cast_fp16)[name = tensor<string, []>("value_3_cast_fp16")];
            tensor<int32, [4]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1]> mh_q_3_cast_fp16 = reshape(shape = var_281, x = query_3_cast_fp16)[name = tensor<string, []>("mh_q_3_cast_fp16")];
            tensor<fp16, []> var_283_to_fp16 = const()[name = tensor<string, []>("op_283_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 20, 64, 1]> var_284_cast_fp16 = mul(x = mh_q_3_cast_fp16, y = var_283_to_fp16)[name = tensor<string, []>("op_284_cast_fp16")];
            tensor<int32, [4]> var_285 = const()[name = tensor<string, []>("op_285"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_286_cast_fp16 = reshape(shape = var_285, x = key_3_cast_fp16)[name = tensor<string, []>("op_286_cast_fp16")];
            tensor<bool, []> mh_w_5_transpose_x_0 = const()[name = tensor<string, []>("mh_w_5_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> mh_w_5_transpose_y_0 = const()[name = tensor<string, []>("mh_w_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 20, 1, 1500]> mh_w_5_cast_fp16 = matmul(transpose_x = mh_w_5_transpose_x_0, transpose_y = mh_w_5_transpose_y_0, x = var_284_cast_fp16, y = var_286_cast_fp16)[name = tensor<string, []>("mh_w_5_cast_fp16")];
            tensor<fp16, [1, 20, 1, 1500]> obj_13_cast_fp16 = softmax(axis = var_70, x = mh_w_5_cast_fp16)[name = tensor<string, []>("obj_13_cast_fp16")];
            tensor<int32, [4]> var_290 = const()[name = tensor<string, []>("op_290"), val = tensor<int32, [4]>([1, 20, 64, -1])];
            tensor<fp16, [1, 20, 64, 1500]> var_291_cast_fp16 = reshape(shape = var_290, x = value_3_cast_fp16)[name = tensor<string, []>("op_291_cast_fp16")];
            tensor<bool, []> attn_3_transpose_x_0 = const()[name = tensor<string, []>("attn_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_3_transpose_y_0 = const()[name = tensor<string, []>("attn_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 20, 64, 1]> attn_3_cast_fp16 = matmul(transpose_x = attn_3_transpose_x_0, transpose_y = attn_3_transpose_y_0, x = var_291_cast_fp16, y = obj_13_cast_fp16)[name = tensor<string, []>("attn_3_cast_fp16")];
            tensor<int32, [4]> var_294 = const()[name = tensor<string, []>("op_294"), val = tensor<int32, [4]>([1, 1280, 1, -1])];
            tensor<fp16, [1, 1280, 1, 1]> input_3_cast_fp16 = reshape(shape = var_294, x = attn_3_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> var_304_pad_type_0 = const()[name = tensor<string, []>("op_304_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_304_strides_0 = const()[name = tensor<string, []>("op_304_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_304_pad_0 = const()[name = tensor<string, []>("op_304_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_304_dilations_0 = const()[name = tensor<string, []>("op_304_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_304_groups_0 = const()[name = tensor<string, []>("op_304_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_o_proj_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [819200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141515456))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142334720))), name = tensor<string, []>("layers_0_encoder_attn_o_proj_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> layers_0_encoder_attn_o_proj_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_encoder_attn_o_proj_inlier_module_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142334848)))];
            tensor<fp16, [1, 1280, 1, 1]> var_304_cast_fp16 = conv(bias = layers_0_encoder_attn_o_proj_inlier_module_bias_to_fp16, dilations = var_304_dilations_0, groups = var_304_groups_0, pad = var_304_pad_0, pad_type = var_304_pad_type_0, strides = var_304_strides_0, weight = layers_0_encoder_attn_o_proj_inlier_module_weight_to_fp16_palettized, x = input_3_cast_fp16)[name = tensor<string, []>("op_304_cast_fp16")];
            tensor<string, []> var_310_pad_type_0 = const()[name = tensor<string, []>("op_310_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_310_strides_0 = const()[name = tensor<string, []>("op_310_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_310_pad_0 = const()[name = tensor<string, []>("op_310_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_310_dilations_0 = const()[name = tensor<string, []>("op_310_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_310_groups_0 = const()[name = tensor<string, []>("op_310_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1280, 1280, 1, 1]> layers_0_encoder_attn_o_proj_outlier_module_weight_to_fp16_sparsified = constexpr_sparse_to_dense()[mask = tensor<uint8, [204800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142349632))), name = tensor<string, []>("layers_0_encoder_attn_o_proj_outlier_module_weight_to_fp16_sparsified"), nonzero_data = tensor<fp16, [6041]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142337472))), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1, 1280, 1, 1]> var_310_cast_fp16 = conv(dilations = var_310_dilations_0, groups = var_310_groups_0, pad = var_310_pad_0, pad_type = var_310_pad_type_0, strides = var_310_strides_0, weight = layers_0_encoder_attn_o_proj_outlier_module_weight_to_fp16_sparsified, x = input_3_cast_fp16)[name = tensor<string, []>("op_310_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> obj_11_cast_fp16 = add(x = var_304_cast_fp16, y = var_310_cast_fp16)[name = tensor<string, []>("obj_11_cast_fp16")];
            tensor<fp16, [1, 1280, 1, 1]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = obj_11_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, [1]> out_5_axes_0 = const()[name = tensor<string, []>("out_5_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, []> var_321_to_fp16 = const()[name = tensor<string, []>("op_321_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> out_5_cast_fp16 = layer_norm(axes = out_5_axes_0, epsilon = var_321_to_fp16, x = inputs_5_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [1280]> input_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("input_5_gamma_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142554496)))];
            tensor<fp16, [1280]> input_5_beta_0_to_fp16 = const()[name = tensor<string, []>("input_5_beta_0_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142557120)))];
            tensor<fp16, []> input_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("input_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1280, 1, 1]> input_5_cast_fp16 = batch_norm(beta = input_5_beta_0_to_fp16, epsilon = input_5_epsilon_0_to_fp16, gamma = input_5_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_5_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> var_339_pad_type_0 = const()[name = tensor<string, []>("op_339_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_339_strides_0 = const()[name = tensor<string, []>("op_339_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_339_pad_0 = const()[name = tensor<string, []>("op_339_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_339_dilations_0 = const()[name = tensor<string, []>("op_339_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_339_groups_0 = const()[name = tensor<string, []>("op_339_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [5120, 1280, 1, 1]> layers_0_fc1_inlier_module_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3276800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142559744))), lut = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145836608))), name = tensor<string, []>("layers_0_fc1_inlier_module_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([5120, 1280, 1, 1])];
            tensor<fp16, [5120]> layers_0_fc1_inlier_module_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_fc1_inlier_module_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145836736)))];
